Autodesk.Revit.DB.UnitUtils.GetTypeCatalogStringForUnit(Autodesk.Revit.DB.ForgeTypeId)
Gets the string used in type catalogs to identify a given unit.
unitTypeId:
Identifier of the unit.
Returns:
The type catalog string, or an empty string if the unit cannot be used in type catalogs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetTypeCatalogStringForSpec(Autodesk.Revit.DB.ForgeTypeId)
Gets the string used in type catalogs to identify a given spec.
specTypeId:
Identifier of the spec.
Returns:
The type catalog string, or an empty string if the spec cannot be used in type catalogs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetUnitGroup(Autodesk.Revit.DB.ForgeTypeId)
Gets the unit group for a given spec.
specTypeId:
Identifier of the spec.
Returns:
The unit group.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a spec identifier. See UnitUtils.IsSpec(ForgeTypeId) and UnitUtils.GetSpecTypeId(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetUnitSymbolType(Autodesk.Revit.DB.ForgeTypeId)
Gets the UnitSymbolType value corresponding to the given symbol identifier.
symbolTypeId:
The symbol identifier.
Returns:
The UnitSymbolType value corresponding to the given symbol identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
symbolTypeId is not a symbol identifier. See UnitUtils.IsSymbol(ForgeTypeId) and UnitUtils.GetSymbolTypeId(UnitSymbolType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsSymbol(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a ForgeTypeId identifies a symbol.
Remarks:
A ForgeTypeId identifies a symbol if it corresponds to a
UnitSymbolType value according to
UnitUtils.GetSymbolTypeId(UnitSymbolType).
symbolTypeId:
The identifier to check.
Returns:
True if the ForgeTypeId identifies a symbol, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetSymbolTypeId(Autodesk.Revit.DB.UnitSymbolType)
Gets the ForgeTypeId identifying the given symbol.
unitSymbolTypeEnum:
The symbol.
Returns:
The identifier of the given symbol.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetDisplayUnitType(Autodesk.Revit.DB.ForgeTypeId)
Gets the DisplayUnitType value corresponding to the given unit identifier.
unitTypeId:
The unit identifier.
Returns:
The DisplayUnitType value corresponding to the given unit identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsUnit(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a ForgeTypeId identifies a unit.
Remarks:
A ForgeTypeId identifies a unit if it corresponds to a valid
DisplayUnitType value according to
UnitUtils.IsValidDisplayUnit(DisplayUnitType) and
UnitUtils.GetUnitTypeId(DisplayUnitType).
unitTypeId:
The identifier to check.
Returns:
True if the ForgeTypeId identifies a unit, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetUnitTypeId(Autodesk.Revit.DB.DisplayUnitType)
Gets the ForgeTypeId identifying the given unit.
displayUnitTypeEnum:
The unit.
Returns:
The identifier of the given unit.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetValidUnits(Autodesk.Revit.DB.ForgeTypeId)
Gets the identifiers of all valid units for a given spec.
specTypeId:
Identifier of the spec.
Returns:
Identifiers of the valid units.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a spec identifier. See UnitUtils.IsSpec(ForgeTypeId) and UnitUtils.GetSpecTypeId(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsValidUnit(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
Checks whether a unit is valid for a given spec.
specTypeId:
Identifier of the spec.
unitTypeId:
Identifier of the unit to check.
Returns:
True if the unit is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a spec identifier. See UnitUtils.IsSpec(ForgeTypeId) and UnitUtils.GetSpecTypeId(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsValidDisplayUnit(Autodesk.Revit.DB.DisplayUnitType)
Checks whether a display unit is valid.
Remarks:
A display unit is considered valid if it is an actual unit like
meters or feet.  Obsolete values and the special values DUT_CUSTOM
and DUT_UNDEFINED are not considered valid.
displayUnitEnum:
The display unit to check.
Returns:
True if the display unit is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetAllSpecs
Gets the identifiers of all available specs.
Returns:
The spec identifiers.
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetUnitType(Autodesk.Revit.DB.ForgeTypeId)
Gets the UnitType value corresponding to the given spec identifier.
specTypeId:
The spec identifier.
Returns:
The UnitType value corresponding to the given spec identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a spec identifier. See UnitUtils.IsSpec(ForgeTypeId) and UnitUtils.GetSpecTypeId(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsSpec(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a ForgeTypeId identifies a spec.
Remarks:
A ForgeTypeId identifies a spec if it corresponds to a valid
UnitType value according to
UnitUtils.IsValidUnitType(UnitType) and
UnitUtils.GetSpecTypeId(UnitType).
specTypeId:
The identifier to check.
Returns:
True if the ForgeTypeId identifies a spec, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetSpecTypeId(Autodesk.Revit.DB.UnitType)
Gets the ForgeTypeId identifying the spec corresponding to the given unit type.
unitTypeEnum:
The unit type.
Returns:
Identifier of the spec corresponding to the given unit type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsValidUnitType(Autodesk.Revit.DB.UnitType)
Checks whether a unit type is valid.
Remarks:
A unit type is considered valid if it is an actual unit type like
UT_Length or UT_Angle.  Obsolete values and the special values
UT_Custom and UT_Undefined are not considered valid.
unitTypeEnum:
The unit type to check.
Returns:
True if the unit type is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.ConvertToInternalUnits(System.Double,Autodesk.Revit.DB.ForgeTypeId)
Converts a value from a given unit to Revit's internal units.
value:
The value to convert.
unitTypeId:
Identifier of the unit quantifying the value.
Returns:
The converted value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.ConvertFromInternalUnits(System.Double,Autodesk.Revit.DB.ForgeTypeId)
Converts a value from Revit's internal units to a given unit.
value:
The value to convert.
unitTypeId:
Identifier of the desired unit.
Returns:
The converted value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UnitUtils.Convert(System.Double,Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
Converts a value from one unit to another, such as square feet to square meters.
value:
The value to convert.
currentUnitTypeId:
Identifier of the current unit.
desiredUnitTypeId:
Identifier of the desired unit.
Returns:
The converted value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
currentUnitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
-or-
desiredUnitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
currentUnitTypeId and desiredUnitTypeId have different dimensions.
Since:
2014